In [57]:
import pandas as pd

# Series

In [58]:
# Criando uma array com os dados
data = [1, 2, 3, 4, 5]

In [59]:
# Transformando a array em uma Series
s = pd.Series(data)

In [60]:
# Mostrando a Array
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [61]:
# Usando um list comprehension pra criar uma lista de index
index = ['Linha' + str(i) for i in range(5)]

In [62]:
# Mostrando como ficou a lista de index
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [63]:
# Recriando a Series anterior mas agora com um index
s = pd.Series(data = data, index = index)

In [64]:
# Mostrando nova Series
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [65]:
# Agora usando um dict comprehension parar criar um dict que venha com index e valor em seguida
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [66]:
# Mostrando como ficou o dict
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [67]:
# Transformando dict em Series
s = pd.Series(data)

In [68]:
# Como ficou
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [69]:
# Fazendo operações com a series (cada linha vai ser somada com 2)
s1 = s + 2

In [70]:
# Resultado
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [71]:
# Fazendo operação de series + series
s2 = s + s1

In [72]:
#Resultado
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

DataFrame

In [73]:
# Criando uma lista 2d com os dados
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [74]:
# Resultado
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [75]:
# Criando um DataFrame com a lista 2D recentemente criada
df1 = pd.DataFrame(data = data)

In [76]:
# Resultado
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [77]:
# Criando uma list comprehension para o index desse DataFrame
index = ['Linha' + str(i) for i in range(3)]

In [78]:
# Resultado
index

['Linha0', 'Linha1', 'Linha2']

In [79]:
# Recriando o DataFrame anterior mas agora com o index
df1 = pd.DataFrame(data = data, index = index)

In [80]:
# Resultado
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [81]:
# List comprehension para nomear as colunas
columns = ['Coluna' + str(i) for i in range(3)]

In [82]:
# Resultado
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [83]:
# Recriando DataFrame anterior, mas agora definindo o nome das colunas
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [84]:
# Resultado
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [85]:
# Criando um Dict 2D qe vai ser nosso próximo DataFrame
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7}, 
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8}, 
        'Coluna3': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [86]:
# Resultado
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna3': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [87]:
# Usando o dict 2D para criar um novo DataFrame e colocando dentro de uma variável
df2 = pd.DataFrame(data)

In [88]:
# Resultado
df2

        Coluna0  Coluna1  Coluna3
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [89]:
# Criando uma lista de Tuplas
data = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [90]:
# Resultado
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [91]:
# Criando um DataFrame com essa lista de tuplas e o index e columns criados anteriormente
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [92]:
# Resultado
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [93]:
# Transformando todos os itens de df1 para 'A'
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [94]:
# Transformando todos os itens de df2 para 'B'
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna3
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [95]:
# Transformando todos os itens de df3 para 'C'
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [96]:
# Criando um novo DataFrame juntando df1, df2 e df3
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2 Coluna3
Linha0       A       A       A     NaN
Linha1       A       A       A     NaN
Linha2       A       A       A     NaN
Linha0       B       B     NaN       B
Linha1       B       B     NaN       B
Linha2       B       B     NaN       B
Linha0       C       C       C     NaN
Linha1       C       C       C     NaN
Linha2       C       C       C     NaN

In [97]:
# Mostrando que a junção pode ser feita batendo linha com linha ao invés de coluna com coluna
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna3 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

## Exercício

In [100]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 1}, 'D': {'X': 2}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  1.0  2.0

In [101]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 1}, 'D': {'X': 2}})
pd.concat([df1, df2], axis = 1)

   A  B  C  D
X  1  2  1  2

In [106]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'], index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [109]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X, Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

    A  B  C
X   1  2  3
 Y  4  5  6

In [110]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4